
# State **`s3://infrahouse-aws-control-289256138624/terraform.tfstate`**
## Affected resources counts

|  Success  |   🟢 Add |    Change |    Destroy |
|:---------:|--------:|----------:|-----------:|
|     ✅     |       3 |         0 |          0 |
## Affected resources by action

|  Action  | Resources                                                                                          |
|:--------:|:---------------------------------------------------------------------------------------------------|
|    🟢     | `module.ih-tf-aws-control-303467602807-state-manager.aws_iam_policy.permissions`                   |
|    🟢     | `module.ih-tf-aws-control-303467602807-state-manager.aws_iam_role.state-manager`                   |
|    🟢     | `module.ih-tf-aws-control-303467602807-state-manager.aws_iam_role_policy_attachment.state-manager` |
|    🟢     | `module.ih-tf-aws-control-289256138624-admin.data.aws_iam_policy.administrator-access:`            |
<details>
<summary>STDOUT</summary>

```[command]/home/runner/work/_temp/29a71e8e-9519-4d0c-814f-99eedbcf19bc/terraform-bin plan -no-color --out=tf.plan
module.ih-tf-aws-control-289256138624-admin.data.aws_iam_policy.administrator-access: Reading...
aws_dynamodb_table.terraform_locks: Refreshing state... [id=infrahouse-terraform-state-locks]
module.ih-tf-aws-control-289256138624-admin.data.aws_iam_policy_document.github-permissions: Reading...
module.ih-tf-aws-control-303467602807-state-manager.data.aws_iam_policy_document.assume: Reading...
data.aws_iam_policy.administrator-access: Reading...
aws_iam_openid_connect_provider.github: Refreshing state... [id=arn:aws:iam::289256138624:oidc-provider/token.actions.githubusercontent.com]
module.buckets["infrahouse-aws-control-303467602807"].aws_s3_bucket.state-bucket: Refreshing state... [id=infrahouse-aws-control-303467602807]
module.ih-tf-aws-control-289256138624-admin.data.aws_iam_policy_document.github-permissions: Read complete after 0s [id=1603774485]
module.ih-tf-aws-control-303467602807-state-manager.data.aws_iam_policy_document.assume: Read complete after 0s [id=4163919237]
module.buckets["infrahouse-github-state"].aws_s3_bucket.state-bucket: Refreshing state... [id=infrahouse-github-state]
module.buckets["infrahouse-aws-control-289256138624"].aws_s3_bucket.state-bucket: Refreshing state... [id=infrahouse-aws-control-289256138624]
module.buckets["infrahouse-aws-control-990466748045"].aws_s3_bucket.state-bucket: Refreshing state... [id=infrahouse-aws-control-990466748045]
data.aws_iam_policy_document.ih-tf-terraform-control-assume: Reading...
data.aws_iam_policy_document.ih-tf-github-control-assume: Reading...
data.aws_iam_policy_document.ih-tf-terraform-control-assume: Read complete after 0s [id=1154989936]
data.aws_iam_policy_document.ih-tf-aws-control-assume: Reading...
data.aws_iam_policy_document.ih-tf-github-control-assume: Read complete after 0s [id=1521129737]
data.aws_iam_policy_document.ih-tf-aws-control-assume: Read complete after 0s [id=1268673852]
aws_iam_role.ih-tf-terraform-control: Refreshing state... [id=ih-tf-terraform-control]
aws_iam_role.ih-tf-github-control: Refreshing state... [id=ih-tf-github-control]
aws_iam_role.ih-tf-aws-control: Refreshing state... [id=ih-tf-aws-control]
module.ih-tf-aws-control-289256138624-admin.data.aws_iam_policy_document.github-assume: Reading...
module.ih-tf-aws-control-289256138624-admin.data.aws_iam_policy_document.github-assume: Read complete after 0s [id=2022835186]
module.ih-tf-aws-control-289256138624-admin.aws_iam_role.github: Refreshing state... [id=ih-tf-aws-control-289256138624-github]
module.ih-tf-aws-control-303467602807-state-manager.data.aws_iam_policy_document.permissions: Reading...
module.ih-tf-aws-control-289256138624-state-manager.data.aws_iam_policy_document.permissions: Reading...
module.ih-tf-aws-control-303467602807-state-manager.data.aws_iam_policy_document.permissions: Read complete after 0s [id=130066451]
module.ih-tf-aws-control-289256138624-state-manager.data.aws_iam_policy_document.permissions: Read complete after 0s [id=3970547186]
module.ih-tf-aws-control-289256138624-state-manager.aws_iam_policy.permissions: Refreshing state... [id=arn:aws:iam::289256138624:policy/ih-tf-aws-control-289256138624-state-manager20230702010953834400000001]
module.ih-tf-aws-control-289256138624-admin.data.aws_iam_policy_document.admin-assume: Reading...
module.ih-tf-aws-control-289256138624-state-manager.data.aws_iam_policy_document.assume: Reading...
module.ih-tf-aws-control-289256138624-state-manager.data.aws_iam_policy_document.assume: Read complete after 0s [id=2704423537]
module.ih-tf-aws-control-289256138624-admin.data.aws_iam_policy_document.admin-assume: Read complete after 0s [id=413646908]
module.ih-tf-aws-control-289256138624-state-manager.aws_iam_role.state-manager: Refreshing state... [id=ih-tf-aws-control-289256138624-state-manager]
module.ih-tf-aws-control-289256138624-admin.aws_iam_role.admin: Refreshing state... [id=ih-tf-aws-control-289256138624-admin]
module.ih-tf-aws-control-289256138624-state-manager.aws_iam_role_policy_attachment.state-manager: Refreshing state... [id=ih-tf-aws-control-289256138624-state-manager-20230702010954358800000002]
module.buckets["infrahouse-github-state"].aws_s3_bucket_server_side_encryption_configuration.default: Refreshing state... [id=infrahouse-github-state]
module.buckets["infrahouse-aws-control-990466748045"].aws_s3_bucket_public_access_block.public_access: Refreshing state... [id=infrahouse-aws-control-990466748045]
module.buckets["infrahouse-aws-control-289256138624"].aws_s3_bucket_server_side_encryption_configuration.default: Refreshing state... [id=infrahouse-aws-control-289256138624]
module.buckets["infrahouse-aws-control-990466748045"].aws_s3_bucket_server_side_encryption_configuration.default: Refreshing state... [id=infrahouse-aws-control-990466748045]
module.buckets["infrahouse-aws-control-289256138624"].aws_s3_bucket_public_access_block.public_access: Refreshing state... [id=infrahouse-aws-control-289256138624]
module.buckets["infrahouse-github-state"].aws_s3_bucket_public_access_block.public_access: Refreshing state... [id=infrahouse-github-state]
module.buckets["infrahouse-aws-control-303467602807"].aws_s3_bucket_server_side_encryption_configuration.default: Refreshing state... [id=infrahouse-aws-control-303467602807]
module.buckets["infrahouse-aws-control-303467602807"].aws_s3_bucket_public_access_block.public_access: Refreshing state... [id=infrahouse-aws-control-303467602807]
module.buckets["infrahouse-aws-control-990466748045"].aws_s3_bucket_versioning.enabled: Refreshing state... [id=infrahouse-aws-control-990466748045]
module.buckets["infrahouse-aws-control-303467602807"].aws_s3_bucket_versioning.enabled: Refreshing state... [id=infrahouse-aws-control-303467602807]
module.buckets["infrahouse-aws-control-289256138624"].aws_s3_bucket_versioning.enabled: Refreshing state... [id=infrahouse-aws-control-289256138624]
module.buckets["infrahouse-github-state"].aws_s3_bucket_versioning.enabled: Refreshing state... [id=infrahouse-github-state]
data.aws_iam_policy.administrator-access: Read complete after 2s [id=arn:aws:iam::aws:policy/AdministratorAccess]
aws_iam_role_policy_attachment.ih-tf-terraform-control: Refreshing state... [id=ih-tf-terraform-control-20230627172733931200000001]
aws_iam_role_policy_attachment.ih-tf-github-control: Refreshing state... [id=ih-tf-github-control-20230627172734370400000002]
aws_iam_role_policy_attachment.ih-tf-aws-control: Refreshing state... [id=ih-tf-aws-control-20230630003530530900000001]
module.ih-tf-aws-control-289256138624-admin.data.aws_iam_policy.administrator-access: Read complete after 2s [id=arn:aws:iam::aws:policy/AdministratorAccess]
module.ih-tf-aws-control-289256138624-admin.aws_iam_role_policy_attachment.admin: Refreshing state... [id=ih-tf-aws-control-289256138624-admin-20230702015240186500000001]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.ih-tf-aws-control-303467602807-state-manager.aws_iam_policy.permissions will be created
  + resource "aws_iam_policy" "permissions" {
      + arn         = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
      + name_prefix = "ih-tf-aws-control-303467602807-state-manager"
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "s3:ListBucket"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:s3:::infrahouse-aws-control-303467602807"
                      + Sid      = ""
                    },
                  + {
                      + Action   = [
                          + "s3:PutObject",
                          + "s3:GetObject",
                          + "s3:DeleteObject",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:s3:::infrahouse-aws-control-303467602807/terraform.tfstate"
                      + Sid      = ""
                    },
                  + {
                      + Action   = [
                          + "dynamodb:PutItem",
                          + "dynamodb:GetItem",
                          + "dynamodb:DescribeTable",
                          + "dynamodb:DeleteItem",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:dynamodb:us-west-1:289256138624:table/infrahouse-terraform-state-locks"
                      + Sid      = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = {
          + "created_by" = "infrahouse/aws-control-289256138624"
        }
    }

  # module.ih-tf-aws-control-303467602807-state-manager.aws_iam_role.state-manager will be created
  + resource "aws_iam_role" "state-manager" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = [
                              + "arn:aws:iam::990466748045:user/aleks",
                              + "arn:aws:iam::303467602807:role/ih-tf-aws-control-303467602807-github",
                            ]
                        }
                      + Sid       = "000"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + description           = "Role to manage a terraform state of a repo"
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "ih-tf-aws-control-303467602807-state-manager"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + role_last_used        = (known after apply)
      + tags_all              = {
          + "created_by" = "infrahouse/aws-control-289256138624"
        }
      + unique_id             = (known after apply)
    }

  # module.ih-tf-aws-control-303467602807-state-manager.aws_iam_role_policy_attachment.state-manager will be created
  + resource "aws_iam_role_policy_attachment" "state-manager" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "ih-tf-aws-control-303467602807-state-manager"
    }

Plan: 3 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tf.plan

To perform exactly these actions, run the following command to apply:
    terraform apply "tf.plan"
Releasing state lock. This may take a few moments...
::debug::Terraform exited with code 0.
::debug::stdout: module.ih-tf-aws-control-289256138624-admin.data.aws_iam_policy.administrator-access: Reading...%0Aaws_dynamodb_table.terraform_locks: Refreshing state... [id=infrahouse-terraform-state-locks]%0Amodule.ih-tf-aws-control-289256138624-admin.data.aws_iam_policy_document.github-permissions: Reading...%0Amodule.ih-tf-aws-control-303467602807-state-manager.data.aws_iam_policy_document.assume: Reading...%0Adata.aws_iam_policy.administrator-access: Reading...%0Aaws_iam_openid_connect_provider.github: Refreshing state... [id=arn:aws:iam::289256138624:oidc-provider/token.actions.githubusercontent.com]%0Amodule.buckets["infrahouse-aws-control-303467602807"].aws_s3_bucket.state-bucket: Refreshing state... [id=infrahouse-aws-control-303467602807]%0Amodule.ih-tf-aws-control-289256138624-admin.data.aws_iam_policy_document.github-permissions: Read complete after 0s [id=1603774485]%0Amodule.ih-tf-aws-control-303467602807-state-manager.data.aws_iam_policy_document.assume: Read complete after 0s [id=4163919237]%0Amodule.buckets["infrahouse-github-state"].aws_s3_bucket.state-bucket: Refreshing state... [id=infrahouse-github-state]%0Amodule.buckets["infrahouse-aws-control-289256138624"].aws_s3_bucket.state-bucket: Refreshing state... [id=infrahouse-aws-control-289256138624]%0Amodule.buckets["infrahouse-aws-control-990466748045"].aws_s3_bucket.state-bucket: Refreshing state... [id=infrahouse-aws-control-990466748045]%0Adata.aws_iam_policy_document.ih-tf-terraform-control-assume: Reading...%0Adata.aws_iam_policy_document.ih-tf-github-control-assume: Reading...%0Adata.aws_iam_policy_document.ih-tf-terraform-control-assume: Read complete after 0s [id=1154989936]%0Adata.aws_iam_policy_document.ih-tf-aws-control-assume: Reading...%0Adata.aws_iam_policy_document.ih-tf-github-control-assume: Read complete after 0s [id=1521129737]%0Adata.aws_iam_policy_document.ih-tf-aws-control-assume: Read complete after 0s [id=1268673852]%0Aaws_iam_role.ih-tf-terraform-control: Refreshing state... [id=ih-tf-terraform-control]%0Aaws_iam_role.ih-tf-github-control: Refreshing state... [id=ih-tf-github-control]%0Aaws_iam_role.ih-tf-aws-control: Refreshing state... [id=ih-tf-aws-control]%0Amodule.ih-tf-aws-control-289256138624-admin.data.aws_iam_policy_document.github-assume: Reading...%0Amodule.ih-tf-aws-control-289256138624-admin.data.aws_iam_policy_document.github-assume: Read complete after 0s [id=2022835186]%0Amodule.ih-tf-aws-control-289256138624-admin.aws_iam_role.github: Refreshing state... [id=ih-tf-aws-control-289256138624-github]%0Amodule.ih-tf-aws-control-303467602807-state-manager.data.aws_iam_policy_document.permissions: Reading...%0Amodule.ih-tf-aws-control-289256138624-state-manager.data.aws_iam_policy_document.permissions: Reading...%0Amodule.ih-tf-aws-control-303467602807-state-manager.data.aws_iam_policy_document.permissions: Read complete after 0s [id=130066451]%0Amodule.ih-tf-aws-control-289256138624-state-manager.data.aws_iam_policy_document.permissions: Read complete after 0s [id=3970547186]%0Amodule.ih-tf-aws-control-289256138624-state-manager.aws_iam_policy.permissions: Refreshing state... [id=arn:aws:iam::289256138624:policy/ih-tf-aws-control-289256138624-state-manager20230702010953834400000001]%0Amodule.ih-tf-aws-control-289256138624-admin.data.aws_iam_policy_document.admin-assume: Reading...%0Amodule.ih-tf-aws-control-289256138624-state-manager.data.aws_iam_policy_document.assume: Reading...%0Amodule.ih-tf-aws-control-289256138624-state-manager.data.aws_iam_policy_document.assume: Read complete after 0s [id=2704423537]%0Amodule.ih-tf-aws-control-289256138624-admin.data.aws_iam_policy_document.admin-assume: Read complete after 0s [id=413646908]%0Amodule.ih-tf-aws-control-289256138624-state-manager.aws_iam_role.state-manager: Refreshing state... [id=ih-tf-aws-control-289256138624-state-manager]%0Amodule.ih-tf-aws-control-289256138624-admin.aws_iam_role.admin: Refreshing state... [id=ih-tf-aws-control-289256138624-admin]%0Amodule.ih-tf-aws-control-289256138624-state-manager.aws_iam_role_policy_attachment.state-manager: Refreshing state... [id=ih-tf-aws-control-289256138624-state-manager-20230702010954358800000002]%0Amodule.buckets["infrahouse-github-state"].aws_s3_bucket_server_side_encryption_configuration.default: Refreshing state... [id=infrahouse-github-state]%0Amodule.buckets["infrahouse-aws-control-990466748045"].aws_s3_bucket_public_access_block.public_access: Refreshing state... [id=infrahouse-aws-control-990466748045]%0Amodule.buckets["infrahouse-aws-control-289256138624"].aws_s3_bucket_server_side_encryption_configuration.default: Refreshing state... [id=infrahouse-aws-control-289256138624]%0Amodule.buckets["infrahouse-aws-control-990466748045"].aws_s3_bucket_server_side_encryption_configuration.default: Refreshing state... [id=infrahouse-aws-control-990466748045]%0Amodule.buckets["infrahouse-aws-control-289256138624"].aws_s3_bucket_public_access_block.public_access: Refreshing state... [id=infrahouse-aws-control-289256138624]%0Amodule.buckets["infrahouse-github-state"].aws_s3_bucket_public_access_block.public_access: Refreshing state... [id=infrahouse-github-state]%0Amodule.buckets["infrahouse-aws-control-303467602807"].aws_s3_bucket_server_side_encryption_configuration.default: Refreshing state... [id=infrahouse-aws-control-303467602807]%0Amodule.buckets["infrahouse-aws-control-303467602807"].aws_s3_bucket_public_access_block.public_access: Refreshing state... [id=infrahouse-aws-control-303467602807]%0Amodule.buckets["infrahouse-aws-control-990466748045"].aws_s3_bucket_versioning.enabled: Refreshing state... [id=infrahouse-aws-control-990466748045]%0Amodule.buckets["infrahouse-aws-control-303467602807"].aws_s3_bucket_versioning.enabled: Refreshing state... [id=infrahouse-aws-control-303467602807]%0Amodule.buckets["infrahouse-aws-control-289256138624"].aws_s3_bucket_versioning.enabled: Refreshing state... [id=infrahouse-aws-control-289256138624]%0Amodule.buckets["infrahouse-github-state"].aws_s3_bucket_versioning.enabled: Refreshing state... [id=infrahouse-github-state]%0Adata.aws_iam_policy.administrator-access: Read complete after 2s [id=arn:aws:iam::aws:policy/AdministratorAccess]%0Aaws_iam_role_policy_attachment.ih-tf-terraform-control: Refreshing state... [id=ih-tf-terraform-control-20230627172733931200000001]%0Aaws_iam_role_policy_attachment.ih-tf-github-control: Refreshing state... [id=ih-tf-github-control-20230627172734370400000002]%0Aaws_iam_role_policy_attachment.ih-tf-aws-control: Refreshing state... [id=ih-tf-aws-control-20230630003530530900000001]%0Amodule.ih-tf-aws-control-289256138624-admin.data.aws_iam_policy.administrator-access: Read complete after 2s [id=arn:aws:iam::aws:policy/AdministratorAccess]%0Amodule.ih-tf-aws-control-289256138624-admin.aws_iam_role_policy_attachment.admin: Refreshing state... [id=ih-tf-aws-control-289256138624-admin-20230702015240186500000001]%0A%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A%0ATerraform will perform the following actions:%0A%0A  # module.ih-tf-aws-control-303467602807-state-manager.aws_iam_policy.permissions will be created%0A  + resource "aws_iam_policy" "permissions" {%0A      + arn         = (known after apply)%0A      + id          = (known after apply)%0A      + name        = (known after apply)%0A      + name_prefix = "ih-tf-aws-control-303467602807-state-manager"%0A      + path        = "/"%0A      + policy      = jsonencode(%0A            {%0A              + Statement = [%0A                  + {%0A                      + Action   = "s3:ListBucket"%0A                      + Effect   = "Allow"%0A                      + Resource = "arn:aws:s3:::infrahouse-aws-control-303467602807"%0A                      + Sid      = ""%0A                    },%0A                  + {%0A                      + Action   = [%0A                          + "s3:PutObject",%0A                          + "s3:GetObject",%0A                          + "s3:DeleteObject",%0A                        ]%0A                      + Effect   = "Allow"%0A                      + Resource = "arn:aws:s3:::infrahouse-aws-control-303467602807/terraform.tfstate"%0A                      + Sid      = ""%0A                    },%0A                  + {%0A                      + Action   = [%0A                          + "dynamodb:PutItem",%0A                          + "dynamodb:GetItem",%0A                          + "dynamodb:DescribeTable",%0A                          + "dynamodb:DeleteItem",%0A                        ]%0A                      + Effect   = "Allow"%0A                      + Resource = "arn:aws:dynamodb:us-west-1:289256138624:table/infrahouse-terraform-state-locks"%0A                      + Sid      = ""%0A                    },%0A                ]%0A              + Version   = "2012-10-17"%0A            }%0A        )%0A      + policy_id   = (known after apply)%0A      + tags_all    = {%0A          + "created_by" = "infrahouse/aws-control-289256138624"%0A        }%0A    }%0A%0A  # module.ih-tf-aws-control-303467602807-state-manager.aws_iam_role.state-manager will be created%0A  + resource "aws_iam_role" "state-manager" {%0A      + arn                   = (known after apply)%0A      + assume_role_policy    = jsonencode(%0A            {%0A              + Statement = [%0A                  + {%0A                      + Action    = "sts:AssumeRole"%0A                      + Effect    = "Allow"%0A                      + Principal = {%0A                          + AWS = [%0A                              + "arn:aws:iam::990466748045:user/aleks",%0A                              + "arn:aws:iam::303467602807:role/ih-tf-aws-control-303467602807-github",%0A                            ]%0A                        }%0A                      + Sid       = "000"%0A                    },%0A                ]%0A              + Version   = "2012-10-17"%0A            }%0A        )%0A      + create_date           = (known after apply)%0A      + description           = "Role to manage a terraform state of a repo"%0A      + force_detach_policies = false%0A      + id                    = (known after apply)%0A      + managed_policy_arns   = (known after apply)%0A      + max_session_duration  = 3600%0A      + name                  = "ih-tf-aws-control-303467602807-state-manager"%0A      + name_prefix           = (known after apply)%0A      + path                  = "/"%0A      + role_last_used        = (known after apply)%0A      + tags_all              = {%0A          + "created_by" = "infrahouse/aws-control-289256138624"%0A        }%0A      + unique_id             = (known after apply)%0A    }%0A%0A  # module.ih-tf-aws-control-303467602807-state-manager.aws_iam_role_policy_attachment.state-manager will be created%0A  + resource "aws_iam_role_policy_attachment" "state-manager" {%0A      + id         = (known after apply)%0A      + policy_arn = (known after apply)%0A      + role       = "ih-tf-aws-control-303467602807-state-manager"%0A    }%0A%0APlan: 3 to add, 0 to change, 0 to destroy.%0A%0A─────────────────────────────────────────────────────────────────────────────%0A%0ASaved the plan to: tf.plan%0A%0ATo perform exactly these actions, run the following command to apply:%0A    terraform apply "tf.plan"%0AReleasing state lock. This may take a few moments...%0A
::debug::stderr: 
::debug::exitcode: 0
```
</details>
<details>
<summary>STDERR</summary>

```no output```
</details>
<details><summary><i>metadata</i></summary>
<p>
```eyJzMzovL2luZnJhaG91c2UtYXdzLWNvbnRyb2wtMjg5MjU2MTM4NjI0L3RlcnJhZm9ybS50ZnN0YXRlIjogeyJzdWNjZXNzIjogdHJ1ZSwgInN0ZG91dCI6ICJbY29tbWFuZF0vaG9tZS9ydW5uZXIvd29yay9fdGVtcC8yOWE3MWU4ZS05NTE5LTRkMGMtODE0Zi05OWVlZGJjZjE5YmMvdGVycmFmb3JtLWJpbiBwbGFuIC1uby1jb2xvciAtLW91dD10Zi5wbGFuXG5tb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtMjg5MjU2MTM4NjI0LWFkbWluLmRhdGEuYXdzX2lhbV9wb2xpY3kuYWRtaW5pc3RyYXRvci1hY2Nlc3M6IFJlYWRpbmcuLi5cbmF3c19keW5hbW9kYl90YWJsZS50ZXJyYWZvcm1fbG9ja3M6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWluZnJhaG91c2UtdGVycmFmb3JtLXN0YXRlLWxvY2tzXVxubW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTI4OTI1NjEzODYyNC1hZG1pbi5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmdpdGh1Yi1wZXJtaXNzaW9uczogUmVhZGluZy4uLlxubW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTMwMzQ2NzYwMjgwNy1zdGF0ZS1tYW5hZ2VyLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuYXNzdW1lOiBSZWFkaW5nLi4uXG5kYXRhLmF3c19pYW1fcG9saWN5LmFkbWluaXN0cmF0b3ItYWNjZXNzOiBSZWFkaW5nLi4uXG5hd3NfaWFtX29wZW5pZF9jb25uZWN0X3Byb3ZpZGVyLmdpdGh1YjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXJuOmF3czppYW06OjI4OTI1NjEzODYyNDpvaWRjLXByb3ZpZGVyL3Rva2VuLmFjdGlvbnMuZ2l0aHVidXNlcmNvbnRlbnQuY29tXVxubW9kdWxlLmJ1Y2tldHNbXCJpbmZyYWhvdXNlLWF3cy1jb250cm9sLTMwMzQ2NzYwMjgwN1wiXS5hd3NfczNfYnVja2V0LnN0YXRlLWJ1Y2tldDogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aW5mcmFob3VzZS1hd3MtY29udHJvbC0zMDM0Njc2MDI4MDddXG5tb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtMjg5MjU2MTM4NjI0LWFkbWluLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuZ2l0aHViLXBlcm1pc3Npb25zOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD0xNjAzNzc0NDg1XVxubW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTMwMzQ2NzYwMjgwNy1zdGF0ZS1tYW5hZ2VyLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuYXNzdW1lOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD00MTYzOTE5MjM3XVxubW9kdWxlLmJ1Y2tldHNbXCJpbmZyYWhvdXNlLWdpdGh1Yi1zdGF0ZVwiXS5hd3NfczNfYnVja2V0LnN0YXRlLWJ1Y2tldDogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aW5mcmFob3VzZS1naXRodWItc3RhdGVdXG5tb2R1bGUuYnVja2V0c1tcImluZnJhaG91c2UtYXdzLWNvbnRyb2wtMjg5MjU2MTM4NjI0XCJdLmF3c19zM19idWNrZXQuc3RhdGUtYnVja2V0OiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pbmZyYWhvdXNlLWF3cy1jb250cm9sLTI4OTI1NjEzODYyNF1cbm1vZHVsZS5idWNrZXRzW1wiaW5mcmFob3VzZS1hd3MtY29udHJvbC05OTA0NjY3NDgwNDVcIl0uYXdzX3MzX2J1Y2tldC5zdGF0ZS1idWNrZXQ6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWluZnJhaG91c2UtYXdzLWNvbnRyb2wtOTkwNDY2NzQ4MDQ1XVxuZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5paC10Zi10ZXJyYWZvcm0tY29udHJvbC1hc3N1bWU6IFJlYWRpbmcuLi5cbmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuaWgtdGYtZ2l0aHViLWNvbnRyb2wtYXNzdW1lOiBSZWFkaW5nLi4uXG5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmloLXRmLXRlcnJhZm9ybS1jb250cm9sLWFzc3VtZTogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9MTE1NDk4OTkzNl1cbmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuaWgtdGYtYXdzLWNvbnRyb2wtYXNzdW1lOiBSZWFkaW5nLi4uXG5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmloLXRmLWdpdGh1Yi1jb250cm9sLWFzc3VtZTogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9MTUyMTEyOTczN11cbmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuaWgtdGYtYXdzLWNvbnRyb2wtYXNzdW1lOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD0xMjY4NjczODUyXVxuYXdzX2lhbV9yb2xlLmloLXRmLXRlcnJhZm9ybS1jb250cm9sOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1paC10Zi10ZXJyYWZvcm0tY29udHJvbF1cbmF3c19pYW1fcm9sZS5paC10Zi1naXRodWItY29udHJvbDogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aWgtdGYtZ2l0aHViLWNvbnRyb2xdXG5hd3NfaWFtX3JvbGUuaWgtdGYtYXdzLWNvbnRyb2w6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWloLXRmLWF3cy1jb250cm9sXVxubW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTI4OTI1NjEzODYyNC1hZG1pbi5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmdpdGh1Yi1hc3N1bWU6IFJlYWRpbmcuLi5cbm1vZHVsZS5paC10Zi1hd3MtY29udHJvbC0yODkyNTYxMzg2MjQtYWRtaW4uZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5naXRodWItYXNzdW1lOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD0yMDIyODM1MTg2XVxubW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTI4OTI1NjEzODYyNC1hZG1pbi5hd3NfaWFtX3JvbGUuZ2l0aHViOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1paC10Zi1hd3MtY29udHJvbC0yODkyNTYxMzg2MjQtZ2l0aHViXVxubW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTMwMzQ2NzYwMjgwNy1zdGF0ZS1tYW5hZ2VyLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQucGVybWlzc2lvbnM6IFJlYWRpbmcuLi5cbm1vZHVsZS5paC10Zi1hd3MtY29udHJvbC0yODkyNTYxMzg2MjQtc3RhdGUtbWFuYWdlci5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LnBlcm1pc3Npb25zOiBSZWFkaW5nLi4uXG5tb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3LXN0YXRlLW1hbmFnZXIuZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5wZXJtaXNzaW9uczogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9MTMwMDY2NDUxXVxubW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTI4OTI1NjEzODYyNC1zdGF0ZS1tYW5hZ2VyLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQucGVybWlzc2lvbnM6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTM5NzA1NDcxODZdXG5tb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtMjg5MjU2MTM4NjI0LXN0YXRlLW1hbmFnZXIuYXdzX2lhbV9wb2xpY3kucGVybWlzc2lvbnM6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWFybjphd3M6aWFtOjoyODkyNTYxMzg2MjQ6cG9saWN5L2loLXRmLWF3cy1jb250cm9sLTI4OTI1NjEzODYyNC1zdGF0ZS1tYW5hZ2VyMjAyMzA3MDIwMTA5NTM4MzQ0MDAwMDAwMDFdXG5tb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtMjg5MjU2MTM4NjI0LWFkbWluLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuYWRtaW4tYXNzdW1lOiBSZWFkaW5nLi4uXG5tb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtMjg5MjU2MTM4NjI0LXN0YXRlLW1hbmFnZXIuZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5hc3N1bWU6IFJlYWRpbmcuLi5cbm1vZHVsZS5paC10Zi1hd3MtY29udHJvbC0yODkyNTYxMzg2MjQtc3RhdGUtbWFuYWdlci5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmFzc3VtZTogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9MjcwNDQyMzUzN11cbm1vZHVsZS5paC10Zi1hd3MtY29udHJvbC0yODkyNTYxMzg2MjQtYWRtaW4uZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5hZG1pbi1hc3N1bWU6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTQxMzY0NjkwOF1cbm1vZHVsZS5paC10Zi1hd3MtY29udHJvbC0yODkyNTYxMzg2MjQtc3RhdGUtbWFuYWdlci5hd3NfaWFtX3JvbGUuc3RhdGUtbWFuYWdlcjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aWgtdGYtYXdzLWNvbnRyb2wtMjg5MjU2MTM4NjI0LXN0YXRlLW1hbmFnZXJdXG5tb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtMjg5MjU2MTM4NjI0LWFkbWluLmF3c19pYW1fcm9sZS5hZG1pbjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aWgtdGYtYXdzLWNvbnRyb2wtMjg5MjU2MTM4NjI0LWFkbWluXVxubW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTI4OTI1NjEzODYyNC1zdGF0ZS1tYW5hZ2VyLmF3c19pYW1fcm9sZV9wb2xpY3lfYXR0YWNobWVudC5zdGF0ZS1tYW5hZ2VyOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1paC10Zi1hd3MtY29udHJvbC0yODkyNTYxMzg2MjQtc3RhdGUtbWFuYWdlci0yMDIzMDcwMjAxMDk1NDM1ODgwMDAwMDAwMl1cbm1vZHVsZS5idWNrZXRzW1wiaW5mcmFob3VzZS1naXRodWItc3RhdGVcIl0uYXdzX3MzX2J1Y2tldF9zZXJ2ZXJfc2lkZV9lbmNyeXB0aW9uX2NvbmZpZ3VyYXRpb24uZGVmYXVsdDogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aW5mcmFob3VzZS1naXRodWItc3RhdGVdXG5tb2R1bGUuYnVja2V0c1tcImluZnJhaG91c2UtYXdzLWNvbnRyb2wtOTkwNDY2NzQ4MDQ1XCJdLmF3c19zM19idWNrZXRfcHVibGljX2FjY2Vzc19ibG9jay5wdWJsaWNfYWNjZXNzOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pbmZyYWhvdXNlLWF3cy1jb250cm9sLTk5MDQ2Njc0ODA0NV1cbm1vZHVsZS5idWNrZXRzW1wiaW5mcmFob3VzZS1hd3MtY29udHJvbC0yODkyNTYxMzg2MjRcIl0uYXdzX3MzX2J1Y2tldF9zZXJ2ZXJfc2lkZV9lbmNyeXB0aW9uX2NvbmZpZ3VyYXRpb24uZGVmYXVsdDogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aW5mcmFob3VzZS1hd3MtY29udHJvbC0yODkyNTYxMzg2MjRdXG5tb2R1bGUuYnVja2V0c1tcImluZnJhaG91c2UtYXdzLWNvbnRyb2wtOTkwNDY2NzQ4MDQ1XCJdLmF3c19zM19idWNrZXRfc2VydmVyX3NpZGVfZW5jcnlwdGlvbl9jb25maWd1cmF0aW9uLmRlZmF1bHQ6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWluZnJhaG91c2UtYXdzLWNvbnRyb2wtOTkwNDY2NzQ4MDQ1XVxubW9kdWxlLmJ1Y2tldHNbXCJpbmZyYWhvdXNlLWF3cy1jb250cm9sLTI4OTI1NjEzODYyNFwiXS5hd3NfczNfYnVja2V0X3B1YmxpY19hY2Nlc3NfYmxvY2sucHVibGljX2FjY2VzczogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aW5mcmFob3VzZS1hd3MtY29udHJvbC0yODkyNTYxMzg2MjRdXG5tb2R1bGUuYnVja2V0c1tcImluZnJhaG91c2UtZ2l0aHViLXN0YXRlXCJdLmF3c19zM19idWNrZXRfcHVibGljX2FjY2Vzc19ibG9jay5wdWJsaWNfYWNjZXNzOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pbmZyYWhvdXNlLWdpdGh1Yi1zdGF0ZV1cbm1vZHVsZS5idWNrZXRzW1wiaW5mcmFob3VzZS1hd3MtY29udHJvbC0zMDM0Njc2MDI4MDdcIl0uYXdzX3MzX2J1Y2tldF9zZXJ2ZXJfc2lkZV9lbmNyeXB0aW9uX2NvbmZpZ3VyYXRpb24uZGVmYXVsdDogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aW5mcmFob3VzZS1hd3MtY29udHJvbC0zMDM0Njc2MDI4MDddXG5tb2R1bGUuYnVja2V0c1tcImluZnJhaG91c2UtYXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3XCJdLmF3c19zM19idWNrZXRfcHVibGljX2FjY2Vzc19ibG9jay5wdWJsaWNfYWNjZXNzOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pbmZyYWhvdXNlLWF3cy1jb250cm9sLTMwMzQ2NzYwMjgwN11cbm1vZHVsZS5idWNrZXRzW1wiaW5mcmFob3VzZS1hd3MtY29udHJvbC05OTA0NjY3NDgwNDVcIl0uYXdzX3MzX2J1Y2tldF92ZXJzaW9uaW5nLmVuYWJsZWQ6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWluZnJhaG91c2UtYXdzLWNvbnRyb2wtOTkwNDY2NzQ4MDQ1XVxubW9kdWxlLmJ1Y2tldHNbXCJpbmZyYWhvdXNlLWF3cy1jb250cm9sLTMwMzQ2NzYwMjgwN1wiXS5hd3NfczNfYnVja2V0X3ZlcnNpb25pbmcuZW5hYmxlZDogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aW5mcmFob3VzZS1hd3MtY29udHJvbC0zMDM0Njc2MDI4MDddXG5tb2R1bGUuYnVja2V0c1tcImluZnJhaG91c2UtYXdzLWNvbnRyb2wtMjg5MjU2MTM4NjI0XCJdLmF3c19zM19idWNrZXRfdmVyc2lvbmluZy5lbmFibGVkOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pbmZyYWhvdXNlLWF3cy1jb250cm9sLTI4OTI1NjEzODYyNF1cbm1vZHVsZS5idWNrZXRzW1wiaW5mcmFob3VzZS1naXRodWItc3RhdGVcIl0uYXdzX3MzX2J1Y2tldF92ZXJzaW9uaW5nLmVuYWJsZWQ6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWluZnJhaG91c2UtZ2l0aHViLXN0YXRlXVxuZGF0YS5hd3NfaWFtX3BvbGljeS5hZG1pbmlzdHJhdG9yLWFjY2VzczogUmVhZCBjb21wbGV0ZSBhZnRlciAycyBbaWQ9YXJuOmF3czppYW06OmF3czpwb2xpY3kvQWRtaW5pc3RyYXRvckFjY2Vzc11cbmF3c19pYW1fcm9sZV9wb2xpY3lfYXR0YWNobWVudC5paC10Zi10ZXJyYWZvcm0tY29udHJvbDogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aWgtdGYtdGVycmFmb3JtLWNvbnRyb2wtMjAyMzA2MjcxNzI3MzM5MzEyMDAwMDAwMDFdXG5hd3NfaWFtX3JvbGVfcG9saWN5X2F0dGFjaG1lbnQuaWgtdGYtZ2l0aHViLWNvbnRyb2w6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWloLXRmLWdpdGh1Yi1jb250cm9sLTIwMjMwNjI3MTcyNzM0MzcwNDAwMDAwMDAyXVxuYXdzX2lhbV9yb2xlX3BvbGljeV9hdHRhY2htZW50LmloLXRmLWF3cy1jb250cm9sOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1paC10Zi1hd3MtY29udHJvbC0yMDIzMDYzMDAwMzUzMDUzMDkwMDAwMDAwMV1cbm1vZHVsZS5paC10Zi1hd3MtY29udHJvbC0yODkyNTYxMzg2MjQtYWRtaW4uZGF0YS5hd3NfaWFtX3BvbGljeS5hZG1pbmlzdHJhdG9yLWFjY2VzczogUmVhZCBjb21wbGV0ZSBhZnRlciAycyBbaWQ9YXJuOmF3czppYW06OmF3czpwb2xpY3kvQWRtaW5pc3RyYXRvckFjY2Vzc11cbm1vZHVsZS5paC10Zi1hd3MtY29udHJvbC0yODkyNTYxMzg2MjQtYWRtaW4uYXdzX2lhbV9yb2xlX3BvbGljeV9hdHRhY2htZW50LmFkbWluOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1paC10Zi1hd3MtY29udHJvbC0yODkyNTYxMzg2MjQtYWRtaW4tMjAyMzA3MDIwMTUyNDAxODY1MDAwMDAwMDFdXG5cblRlcnJhZm9ybSB1c2VkIHRoZSBzZWxlY3RlZCBwcm92aWRlcnMgdG8gZ2VuZXJhdGUgdGhlIGZvbGxvd2luZyBleGVjdXRpb25cbnBsYW4uIFJlc291cmNlIGFjdGlvbnMgYXJlIGluZGljYXRlZCB3aXRoIHRoZSBmb2xsb3dpbmcgc3ltYm9sczpcbiAgKyBjcmVhdGVcblxuVGVycmFmb3JtIHdpbGwgcGVyZm9ybSB0aGUgZm9sbG93aW5nIGFjdGlvbnM6XG5cbiAgIyBtb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3LXN0YXRlLW1hbmFnZXIuYXdzX2lhbV9wb2xpY3kucGVybWlzc2lvbnMgd2lsbCBiZSBjcmVhdGVkXG4gICsgcmVzb3VyY2UgXCJhd3NfaWFtX3BvbGljeVwiIFwicGVybWlzc2lvbnNcIiB7XG4gICAgICArIGFybiAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBpZCAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgbmFtZSAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIG5hbWVfcHJlZml4ID0gXCJpaC10Zi1hd3MtY29udHJvbC0zMDM0Njc2MDI4MDctc3RhdGUtbWFuYWdlclwiXG4gICAgICArIHBhdGggICAgICAgID0gXCIvXCJcbiAgICAgICsgcG9saWN5ICAgICAgPSBqc29uZW5jb2RlKFxuICAgICAgICAgICAge1xuICAgICAgICAgICAgICArIFN0YXRlbWVudCA9IFtcbiAgICAgICAgICAgICAgICAgICsge1xuICAgICAgICAgICAgICAgICAgICAgICsgQWN0aW9uICAgPSBcInMzOkxpc3RCdWNrZXRcIlxuICAgICAgICAgICAgICAgICAgICAgICsgRWZmZWN0ICAgPSBcIkFsbG93XCJcbiAgICAgICAgICAgICAgICAgICAgICArIFJlc291cmNlID0gXCJhcm46YXdzOnMzOjo6aW5mcmFob3VzZS1hd3MtY29udHJvbC0zMDM0Njc2MDI4MDdcIlxuICAgICAgICAgICAgICAgICAgICAgICsgU2lkICAgICAgPSBcIlwiXG4gICAgICAgICAgICAgICAgICAgIH0sXG4gICAgICAgICAgICAgICAgICArIHtcbiAgICAgICAgICAgICAgICAgICAgICArIEFjdGlvbiAgID0gW1xuICAgICAgICAgICAgICAgICAgICAgICAgICArIFwiczM6UHV0T2JqZWN0XCIsXG4gICAgICAgICAgICAgICAgICAgICAgICAgICsgXCJzMzpHZXRPYmplY3RcIixcbiAgICAgICAgICAgICAgICAgICAgICAgICAgKyBcInMzOkRlbGV0ZU9iamVjdFwiLFxuICAgICAgICAgICAgICAgICAgICAgICAgXVxuICAgICAgICAgICAgICAgICAgICAgICsgRWZmZWN0ICAgPSBcIkFsbG93XCJcbiAgICAgICAgICAgICAgICAgICAgICArIFJlc291cmNlID0gXCJhcm46YXdzOnMzOjo6aW5mcmFob3VzZS1hd3MtY29udHJvbC0zMDM0Njc2MDI4MDcvdGVycmFmb3JtLnRmc3RhdGVcIlxuICAgICAgICAgICAgICAgICAgICAgICsgU2lkICAgICAgPSBcIlwiXG4gICAgICAgICAgICAgICAgICAgIH0sXG4gICAgICAgICAgICAgICAgICArIHtcbiAgICAgICAgICAgICAgICAgICAgICArIEFjdGlvbiAgID0gW1xuICAgICAgICAgICAgICAgICAgICAgICAgICArIFwiZHluYW1vZGI6UHV0SXRlbVwiLFxuICAgICAgICAgICAgICAgICAgICAgICAgICArIFwiZHluYW1vZGI6R2V0SXRlbVwiLFxuICAgICAgICAgICAgICAgICAgICAgICAgICArIFwiZHluYW1vZGI6RGVzY3JpYmVUYWJsZVwiLFxuICAgICAgICAgICAgICAgICAgICAgICAgICArIFwiZHluYW1vZGI6RGVsZXRlSXRlbVwiLFxuICAgICAgICAgICAgICAgICAgICAgICAgXVxuICAgICAgICAgICAgICAgICAgICAgICsgRWZmZWN0ICAgPSBcIkFsbG93XCJcbiAgICAgICAgICAgICAgICAgICAgICArIFJlc291cmNlID0gXCJhcm46YXdzOmR5bmFtb2RiOnVzLXdlc3QtMToyODkyNTYxMzg2MjQ6dGFibGUvaW5mcmFob3VzZS10ZXJyYWZvcm0tc3RhdGUtbG9ja3NcIlxuICAgICAgICAgICAgICAgICAgICAgICsgU2lkICAgICAgPSBcIlwiXG4gICAgICAgICAgICAgICAgICAgIH0sXG4gICAgICAgICAgICAgICAgXVxuICAgICAgICAgICAgICArIFZlcnNpb24gICA9IFwiMjAxMi0xMC0xN1wiXG4gICAgICAgICAgICB9XG4gICAgICAgIClcbiAgICAgICsgcG9saWN5X2lkICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIHRhZ3NfYWxsICAgID0ge1xuICAgICAgICAgICsgXCJjcmVhdGVkX2J5XCIgPSBcImluZnJhaG91c2UvYXdzLWNvbnRyb2wtMjg5MjU2MTM4NjI0XCJcbiAgICAgICAgfVxuICAgIH1cblxuICAjIG1vZHVsZS5paC10Zi1hd3MtY29udHJvbC0zMDM0Njc2MDI4MDctc3RhdGUtbWFuYWdlci5hd3NfaWFtX3JvbGUuc3RhdGUtbWFuYWdlciB3aWxsIGJlIGNyZWF0ZWRcbiAgKyByZXNvdXJjZSBcImF3c19pYW1fcm9sZVwiIFwic3RhdGUtbWFuYWdlclwiIHtcbiAgICAgICsgYXJuICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBhc3N1bWVfcm9sZV9wb2xpY3kgICAgPSBqc29uZW5jb2RlKFxuICAgICAgICAgICAge1xuICAgICAgICAgICAgICArIFN0YXRlbWVudCA9IFtcbiAgICAgICAgICAgICAgICAgICsge1xuICAgICAgICAgICAgICAgICAgICAgICsgQWN0aW9uICAgID0gXCJzdHM6QXNzdW1lUm9sZVwiXG4gICAgICAgICAgICAgICAgICAgICAgKyBFZmZlY3QgICAgPSBcIkFsbG93XCJcbiAgICAgICAgICAgICAgICAgICAgICArIFByaW5jaXBhbCA9IHtcbiAgICAgICAgICAgICAgICAgICAgICAgICAgKyBBV1MgPSBbXG4gICAgICAgICAgICAgICAgICAgICAgICAgICAgICArIFwiYXJuOmF3czppYW06Ojk5MDQ2Njc0ODA0NTp1c2VyL2FsZWtzXCIsXG4gICAgICAgICAgICAgICAgICAgICAgICAgICAgICArIFwiYXJuOmF3czppYW06OjMwMzQ2NzYwMjgwNzpyb2xlL2loLXRmLWF3cy1jb250cm9sLTMwMzQ2NzYwMjgwNy1naXRodWJcIixcbiAgICAgICAgICAgICAgICAgICAgICAgICAgICBdXG4gICAgICAgICAgICAgICAgICAgICAgICB9XG4gICAgICAgICAgICAgICAgICAgICAgKyBTaWQgICAgICAgPSBcIjAwMFwiXG4gICAgICAgICAgICAgICAgICAgIH0sXG4gICAgICAgICAgICAgICAgXVxuICAgICAgICAgICAgICArIFZlcnNpb24gICA9IFwiMjAxMi0xMC0xN1wiXG4gICAgICAgICAgICB9XG4gICAgICAgIClcbiAgICAgICsgY3JlYXRlX2RhdGUgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBkZXNjcmlwdGlvbiAgICAgICAgICAgPSBcIlJvbGUgdG8gbWFuYWdlIGEgdGVycmFmb3JtIHN0YXRlIG9mIGEgcmVwb1wiXG4gICAgICArIGZvcmNlX2RldGFjaF9wb2xpY2llcyA9IGZhbHNlXG4gICAgICArIGlkICAgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgbWFuYWdlZF9wb2xpY3lfYXJucyAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBtYXhfc2Vzc2lvbl9kdXJhdGlvbiAgPSAzNjAwXG4gICAgICArIG5hbWUgICAgICAgICAgICAgICAgICA9IFwiaWgtdGYtYXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3LXN0YXRlLW1hbmFnZXJcIlxuICAgICAgKyBuYW1lX3ByZWZpeCAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIHBhdGggICAgICAgICAgICAgICAgICA9IFwiL1wiXG4gICAgICArIHJvbGVfbGFzdF91c2VkICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgdGFnc19hbGwgICAgICAgICAgICAgID0ge1xuICAgICAgICAgICsgXCJjcmVhdGVkX2J5XCIgPSBcImluZnJhaG91c2UvYXdzLWNvbnRyb2wtMjg5MjU2MTM4NjI0XCJcbiAgICAgICAgfVxuICAgICAgKyB1bmlxdWVfaWQgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgfVxuXG4gICMgbW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTMwMzQ2NzYwMjgwNy1zdGF0ZS1tYW5hZ2VyLmF3c19pYW1fcm9sZV9wb2xpY3lfYXR0YWNobWVudC5zdGF0ZS1tYW5hZ2VyIHdpbGwgYmUgY3JlYXRlZFxuICArIHJlc291cmNlIFwiYXdzX2lhbV9yb2xlX3BvbGljeV9hdHRhY2htZW50XCIgXCJzdGF0ZS1tYW5hZ2VyXCIge1xuICAgICAgKyBpZCAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBwb2xpY3lfYXJuID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyByb2xlICAgICAgID0gXCJpaC10Zi1hd3MtY29udHJvbC0zMDM0Njc2MDI4MDctc3RhdGUtbWFuYWdlclwiXG4gICAgfVxuXG5QbGFuOiAzIHRvIGFkZCwgMCB0byBjaGFuZ2UsIDAgdG8gZGVzdHJveS5cblxuXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXG5cblNhdmVkIHRoZSBwbGFuIHRvOiB0Zi5wbGFuXG5cblRvIHBlcmZvcm0gZXhhY3RseSB0aGVzZSBhY3Rpb25zLCBydW4gdGhlIGZvbGxvd2luZyBjb21tYW5kIHRvIGFwcGx5OlxuICAgIHRlcnJhZm9ybSBhcHBseSBcInRmLnBsYW5cIlxuUmVsZWFzaW5nIHN0YXRlIGxvY2suIFRoaXMgbWF5IHRha2UgYSBmZXcgbW9tZW50cy4uLlxuOjpkZWJ1Zzo6VGVycmFmb3JtIGV4aXRlZCB3aXRoIGNvZGUgMC5cbjo6ZGVidWc6OnN0ZG91dDogbW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTI4OTI1NjEzODYyNC1hZG1pbi5kYXRhLmF3c19pYW1fcG9saWN5LmFkbWluaXN0cmF0b3ItYWNjZXNzOiBSZWFkaW5nLi4uJTBBYXdzX2R5bmFtb2RiX3RhYmxlLnRlcnJhZm9ybV9sb2NrczogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aW5mcmFob3VzZS10ZXJyYWZvcm0tc3RhdGUtbG9ja3NdJTBBbW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTI4OTI1NjEzODYyNC1hZG1pbi5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmdpdGh1Yi1wZXJtaXNzaW9uczogUmVhZGluZy4uLiUwQW1vZHVsZS5paC10Zi1hd3MtY29udHJvbC0zMDM0Njc2MDI4MDctc3RhdGUtbWFuYWdlci5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmFzc3VtZTogUmVhZGluZy4uLiUwQWRhdGEuYXdzX2lhbV9wb2xpY3kuYWRtaW5pc3RyYXRvci1hY2Nlc3M6IFJlYWRpbmcuLi4lMEFhd3NfaWFtX29wZW5pZF9jb25uZWN0X3Byb3ZpZGVyLmdpdGh1YjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXJuOmF3czppYW06OjI4OTI1NjEzODYyNDpvaWRjLXByb3ZpZGVyL3Rva2VuLmFjdGlvbnMuZ2l0aHVidXNlcmNvbnRlbnQuY29tXSUwQW1vZHVsZS5idWNrZXRzW1wiaW5mcmFob3VzZS1hd3MtY29udHJvbC0zMDM0Njc2MDI4MDdcIl0uYXdzX3MzX2J1Y2tldC5zdGF0ZS1idWNrZXQ6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWluZnJhaG91c2UtYXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3XSUwQW1vZHVsZS5paC10Zi1hd3MtY29udHJvbC0yODkyNTYxMzg2MjQtYWRtaW4uZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5naXRodWItcGVybWlzc2lvbnM6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTE2MDM3NzQ0ODVdJTBBbW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTMwMzQ2NzYwMjgwNy1zdGF0ZS1tYW5hZ2VyLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuYXNzdW1lOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD00MTYzOTE5MjM3XSUwQW1vZHVsZS5idWNrZXRzW1wiaW5mcmFob3VzZS1naXRodWItc3RhdGVcIl0uYXdzX3MzX2J1Y2tldC5zdGF0ZS1idWNrZXQ6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWluZnJhaG91c2UtZ2l0aHViLXN0YXRlXSUwQW1vZHVsZS5idWNrZXRzW1wiaW5mcmFob3VzZS1hd3MtY29udHJvbC0yODkyNTYxMzg2MjRcIl0uYXdzX3MzX2J1Y2tldC5zdGF0ZS1idWNrZXQ6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWluZnJhaG91c2UtYXdzLWNvbnRyb2wtMjg5MjU2MTM4NjI0XSUwQW1vZHVsZS5idWNrZXRzW1wiaW5mcmFob3VzZS1hd3MtY29udHJvbC05OTA0NjY3NDgwNDVcIl0uYXdzX3MzX2J1Y2tldC5zdGF0ZS1idWNrZXQ6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWluZnJhaG91c2UtYXdzLWNvbnRyb2wtOTkwNDY2NzQ4MDQ1XSUwQWRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuaWgtdGYtdGVycmFmb3JtLWNvbnRyb2wtYXNzdW1lOiBSZWFkaW5nLi4uJTBBZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5paC10Zi1naXRodWItY29udHJvbC1hc3N1bWU6IFJlYWRpbmcuLi4lMEFkYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmloLXRmLXRlcnJhZm9ybS1jb250cm9sLWFzc3VtZTogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9MTE1NDk4OTkzNl0lMEFkYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmloLXRmLWF3cy1jb250cm9sLWFzc3VtZTogUmVhZGluZy4uLiUwQWRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuaWgtdGYtZ2l0aHViLWNvbnRyb2wtYXNzdW1lOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD0xNTIxMTI5NzM3XSUwQWRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuaWgtdGYtYXdzLWNvbnRyb2wtYXNzdW1lOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD0xMjY4NjczODUyXSUwQWF3c19pYW1fcm9sZS5paC10Zi10ZXJyYWZvcm0tY29udHJvbDogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aWgtdGYtdGVycmFmb3JtLWNvbnRyb2xdJTBBYXdzX2lhbV9yb2xlLmloLXRmLWdpdGh1Yi1jb250cm9sOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1paC10Zi1naXRodWItY29udHJvbF0lMEFhd3NfaWFtX3JvbGUuaWgtdGYtYXdzLWNvbnRyb2w6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWloLXRmLWF3cy1jb250cm9sXSUwQW1vZHVsZS5paC10Zi1hd3MtY29udHJvbC0yODkyNTYxMzg2MjQtYWRtaW4uZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5naXRodWItYXNzdW1lOiBSZWFkaW5nLi4uJTBBbW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTI4OTI1NjEzODYyNC1hZG1pbi5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmdpdGh1Yi1hc3N1bWU6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTIwMjI4MzUxODZdJTBBbW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTI4OTI1NjEzODYyNC1hZG1pbi5hd3NfaWFtX3JvbGUuZ2l0aHViOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1paC10Zi1hd3MtY29udHJvbC0yODkyNTYxMzg2MjQtZ2l0aHViXSUwQW1vZHVsZS5paC10Zi1hd3MtY29udHJvbC0zMDM0Njc2MDI4MDctc3RhdGUtbWFuYWdlci5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LnBlcm1pc3Npb25zOiBSZWFkaW5nLi4uJTBBbW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTI4OTI1NjEzODYyNC1zdGF0ZS1tYW5hZ2VyLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQucGVybWlzc2lvbnM6IFJlYWRpbmcuLi4lMEFtb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3LXN0YXRlLW1hbmFnZXIuZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5wZXJtaXNzaW9uczogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9MTMwMDY2NDUxXSUwQW1vZHVsZS5paC10Zi1hd3MtY29udHJvbC0yODkyNTYxMzg2MjQtc3RhdGUtbWFuYWdlci5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LnBlcm1pc3Npb25zOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD0zOTcwNTQ3MTg2XSUwQW1vZHVsZS5paC10Zi1hd3MtY29udHJvbC0yODkyNTYxMzg2MjQtc3RhdGUtbWFuYWdlci5hd3NfaWFtX3BvbGljeS5wZXJtaXNzaW9uczogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXJuOmF3czppYW06OjI4OTI1NjEzODYyNDpwb2xpY3kvaWgtdGYtYXdzLWNvbnRyb2wtMjg5MjU2MTM4NjI0LXN0YXRlLW1hbmFnZXIyMDIzMDcwMjAxMDk1MzgzNDQwMDAwMDAwMV0lMEFtb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtMjg5MjU2MTM4NjI0LWFkbWluLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuYWRtaW4tYXNzdW1lOiBSZWFkaW5nLi4uJTBBbW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTI4OTI1NjEzODYyNC1zdGF0ZS1tYW5hZ2VyLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuYXNzdW1lOiBSZWFkaW5nLi4uJTBBbW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTI4OTI1NjEzODYyNC1zdGF0ZS1tYW5hZ2VyLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuYXNzdW1lOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD0yNzA0NDIzNTM3XSUwQW1vZHVsZS5paC10Zi1hd3MtY29udHJvbC0yODkyNTYxMzg2MjQtYWRtaW4uZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5hZG1pbi1hc3N1bWU6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTQxMzY0NjkwOF0lMEFtb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtMjg5MjU2MTM4NjI0LXN0YXRlLW1hbmFnZXIuYXdzX2lhbV9yb2xlLnN0YXRlLW1hbmFnZXI6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWloLXRmLWF3cy1jb250cm9sLTI4OTI1NjEzODYyNC1zdGF0ZS1tYW5hZ2VyXSUwQW1vZHVsZS5paC10Zi1hd3MtY29udHJvbC0yODkyNTYxMzg2MjQtYWRtaW4uYXdzX2lhbV9yb2xlLmFkbWluOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1paC10Zi1hd3MtY29udHJvbC0yODkyNTYxMzg2MjQtYWRtaW5dJTBBbW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTI4OTI1NjEzODYyNC1zdGF0ZS1tYW5hZ2VyLmF3c19pYW1fcm9sZV9wb2xpY3lfYXR0YWNobWVudC5zdGF0ZS1tYW5hZ2VyOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1paC10Zi1hd3MtY29udHJvbC0yODkyNTYxMzg2MjQtc3RhdGUtbWFuYWdlci0yMDIzMDcwMjAxMDk1NDM1ODgwMDAwMDAwMl0lMEFtb2R1bGUuYnVja2V0c1tcImluZnJhaG91c2UtZ2l0aHViLXN0YXRlXCJdLmF3c19zM19idWNrZXRfc2VydmVyX3NpZGVfZW5jcnlwdGlvbl9jb25maWd1cmF0aW9uLmRlZmF1bHQ6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWluZnJhaG91c2UtZ2l0aHViLXN0YXRlXSUwQW1vZHVsZS5idWNrZXRzW1wiaW5mcmFob3VzZS1hd3MtY29udHJvbC05OTA0NjY3NDgwNDVcIl0uYXdzX3MzX2J1Y2tldF9wdWJsaWNfYWNjZXNzX2Jsb2NrLnB1YmxpY19hY2Nlc3M6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWluZnJhaG91c2UtYXdzLWNvbnRyb2wtOTkwNDY2NzQ4MDQ1XSUwQW1vZHVsZS5idWNrZXRzW1wiaW5mcmFob3VzZS1hd3MtY29udHJvbC0yODkyNTYxMzg2MjRcIl0uYXdzX3MzX2J1Y2tldF9zZXJ2ZXJfc2lkZV9lbmNyeXB0aW9uX2NvbmZpZ3VyYXRpb24uZGVmYXVsdDogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aW5mcmFob3VzZS1hd3MtY29udHJvbC0yODkyNTYxMzg2MjRdJTBBbW9kdWxlLmJ1Y2tldHNbXCJpbmZyYWhvdXNlLWF3cy1jb250cm9sLTk5MDQ2Njc0ODA0NVwiXS5hd3NfczNfYnVja2V0X3NlcnZlcl9zaWRlX2VuY3J5cHRpb25fY29uZmlndXJhdGlvbi5kZWZhdWx0OiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pbmZyYWhvdXNlLWF3cy1jb250cm9sLTk5MDQ2Njc0ODA0NV0lMEFtb2R1bGUuYnVja2V0c1tcImluZnJhaG91c2UtYXdzLWNvbnRyb2wtMjg5MjU2MTM4NjI0XCJdLmF3c19zM19idWNrZXRfcHVibGljX2FjY2Vzc19ibG9jay5wdWJsaWNfYWNjZXNzOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pbmZyYWhvdXNlLWF3cy1jb250cm9sLTI4OTI1NjEzODYyNF0lMEFtb2R1bGUuYnVja2V0c1tcImluZnJhaG91c2UtZ2l0aHViLXN0YXRlXCJdLmF3c19zM19idWNrZXRfcHVibGljX2FjY2Vzc19ibG9jay5wdWJsaWNfYWNjZXNzOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pbmZyYWhvdXNlLWdpdGh1Yi1zdGF0ZV0lMEFtb2R1bGUuYnVja2V0c1tcImluZnJhaG91c2UtYXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3XCJdLmF3c19zM19idWNrZXRfc2VydmVyX3NpZGVfZW5jcnlwdGlvbl9jb25maWd1cmF0aW9uLmRlZmF1bHQ6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWluZnJhaG91c2UtYXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3XSUwQW1vZHVsZS5idWNrZXRzW1wiaW5mcmFob3VzZS1hd3MtY29udHJvbC0zMDM0Njc2MDI4MDdcIl0uYXdzX3MzX2J1Y2tldF9wdWJsaWNfYWNjZXNzX2Jsb2NrLnB1YmxpY19hY2Nlc3M6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWluZnJhaG91c2UtYXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3XSUwQW1vZHVsZS5idWNrZXRzW1wiaW5mcmFob3VzZS1hd3MtY29udHJvbC05OTA0NjY3NDgwNDVcIl0uYXdzX3MzX2J1Y2tldF92ZXJzaW9uaW5nLmVuYWJsZWQ6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWluZnJhaG91c2UtYXdzLWNvbnRyb2wtOTkwNDY2NzQ4MDQ1XSUwQW1vZHVsZS5idWNrZXRzW1wiaW5mcmFob3VzZS1hd3MtY29udHJvbC0zMDM0Njc2MDI4MDdcIl0uYXdzX3MzX2J1Y2tldF92ZXJzaW9uaW5nLmVuYWJsZWQ6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWluZnJhaG91c2UtYXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3XSUwQW1vZHVsZS5idWNrZXRzW1wiaW5mcmFob3VzZS1hd3MtY29udHJvbC0yODkyNTYxMzg2MjRcIl0uYXdzX3MzX2J1Y2tldF92ZXJzaW9uaW5nLmVuYWJsZWQ6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWluZnJhaG91c2UtYXdzLWNvbnRyb2wtMjg5MjU2MTM4NjI0XSUwQW1vZHVsZS5idWNrZXRzW1wiaW5mcmFob3VzZS1naXRodWItc3RhdGVcIl0uYXdzX3MzX2J1Y2tldF92ZXJzaW9uaW5nLmVuYWJsZWQ6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWluZnJhaG91c2UtZ2l0aHViLXN0YXRlXSUwQWRhdGEuYXdzX2lhbV9wb2xpY3kuYWRtaW5pc3RyYXRvci1hY2Nlc3M6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMnMgW2lkPWFybjphd3M6aWFtOjphd3M6cG9saWN5L0FkbWluaXN0cmF0b3JBY2Nlc3NdJTBBYXdzX2lhbV9yb2xlX3BvbGljeV9hdHRhY2htZW50LmloLXRmLXRlcnJhZm9ybS1jb250cm9sOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1paC10Zi10ZXJyYWZvcm0tY29udHJvbC0yMDIzMDYyNzE3MjczMzkzMTIwMDAwMDAwMV0lMEFhd3NfaWFtX3JvbGVfcG9saWN5X2F0dGFjaG1lbnQuaWgtdGYtZ2l0aHViLWNvbnRyb2w6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWloLXRmLWdpdGh1Yi1jb250cm9sLTIwMjMwNjI3MTcyNzM0MzcwNDAwMDAwMDAyXSUwQWF3c19pYW1fcm9sZV9wb2xpY3lfYXR0YWNobWVudC5paC10Zi1hd3MtY29udHJvbDogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aWgtdGYtYXdzLWNvbnRyb2wtMjAyMzA2MzAwMDM1MzA1MzA5MDAwMDAwMDFdJTBBbW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTI4OTI1NjEzODYyNC1hZG1pbi5kYXRhLmF3c19pYW1fcG9saWN5LmFkbWluaXN0cmF0b3ItYWNjZXNzOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDJzIFtpZD1hcm46YXdzOmlhbTo6YXdzOnBvbGljeS9BZG1pbmlzdHJhdG9yQWNjZXNzXSUwQW1vZHVsZS5paC10Zi1hd3MtY29udHJvbC0yODkyNTYxMzg2MjQtYWRtaW4uYXdzX2lhbV9yb2xlX3BvbGljeV9hdHRhY2htZW50LmFkbWluOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1paC10Zi1hd3MtY29udHJvbC0yODkyNTYxMzg2MjQtYWRtaW4tMjAyMzA3MDIwMTUyNDAxODY1MDAwMDAwMDFdJTBBJTBBVGVycmFmb3JtIHVzZWQgdGhlIHNlbGVjdGVkIHByb3ZpZGVycyB0byBnZW5lcmF0ZSB0aGUgZm9sbG93aW5nIGV4ZWN1dGlvbiUwQXBsYW4uIFJlc291cmNlIGFjdGlvbnMgYXJlIGluZGljYXRlZCB3aXRoIHRoZSBmb2xsb3dpbmcgc3ltYm9sczolMEEgICsgY3JlYXRlJTBBJTBBVGVycmFmb3JtIHdpbGwgcGVyZm9ybSB0aGUgZm9sbG93aW5nIGFjdGlvbnM6JTBBJTBBICAjIG1vZHVsZS5paC10Zi1hd3MtY29udHJvbC0zMDM0Njc2MDI4MDctc3RhdGUtbWFuYWdlci5hd3NfaWFtX3BvbGljeS5wZXJtaXNzaW9ucyB3aWxsIGJlIGNyZWF0ZWQlMEEgICsgcmVzb3VyY2UgXCJhd3NfaWFtX3BvbGljeVwiIFwicGVybWlzc2lvbnNcIiB7JTBBICAgICAgKyBhcm4gICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIGlkICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgbmFtZSAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBuYW1lX3ByZWZpeCA9IFwiaWgtdGYtYXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3LXN0YXRlLW1hbmFnZXJcIiUwQSAgICAgICsgcGF0aCAgICAgICAgPSBcIi9cIiUwQSAgICAgICsgcG9saWN5ICAgICAgPSBqc29uZW5jb2RlKCUwQSAgICAgICAgICAgIHslMEEgICAgICAgICAgICAgICsgU3RhdGVtZW50ID0gWyUwQSAgICAgICAgICAgICAgICAgICsgeyUwQSAgICAgICAgICAgICAgICAgICAgICArIEFjdGlvbiAgID0gXCJzMzpMaXN0QnVja2V0XCIlMEEgICAgICAgICAgICAgICAgICAgICAgKyBFZmZlY3QgICA9IFwiQWxsb3dcIiUwQSAgICAgICAgICAgICAgICAgICAgICArIFJlc291cmNlID0gXCJhcm46YXdzOnMzOjo6aW5mcmFob3VzZS1hd3MtY29udHJvbC0zMDM0Njc2MDI4MDdcIiUwQSAgICAgICAgICAgICAgICAgICAgICArIFNpZCAgICAgID0gXCJcIiUwQSAgICAgICAgICAgICAgICAgICAgfSwlMEEgICAgICAgICAgICAgICAgICArIHslMEEgICAgICAgICAgICAgICAgICAgICAgKyBBY3Rpb24gICA9IFslMEEgICAgICAgICAgICAgICAgICAgICAgICAgICsgXCJzMzpQdXRPYmplY3RcIiwlMEEgICAgICAgICAgICAgICAgICAgICAgICAgICsgXCJzMzpHZXRPYmplY3RcIiwlMEEgICAgICAgICAgICAgICAgICAgICAgICAgICsgXCJzMzpEZWxldGVPYmplY3RcIiwlMEEgICAgICAgICAgICAgICAgICAgICAgICBdJTBBICAgICAgICAgICAgICAgICAgICAgICsgRWZmZWN0ICAgPSBcIkFsbG93XCIlMEEgICAgICAgICAgICAgICAgICAgICAgKyBSZXNvdXJjZSA9IFwiYXJuOmF3czpzMzo6OmluZnJhaG91c2UtYXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3L3RlcnJhZm9ybS50ZnN0YXRlXCIlMEEgICAgICAgICAgICAgICAgICAgICAgKyBTaWQgICAgICA9IFwiXCIlMEEgICAgICAgICAgICAgICAgICAgIH0sJTBBICAgICAgICAgICAgICAgICAgKyB7JTBBICAgICAgICAgICAgICAgICAgICAgICsgQWN0aW9uICAgPSBbJTBBICAgICAgICAgICAgICAgICAgICAgICAgICArIFwiZHluYW1vZGI6UHV0SXRlbVwiLCUwQSAgICAgICAgICAgICAgICAgICAgICAgICAgKyBcImR5bmFtb2RiOkdldEl0ZW1cIiwlMEEgICAgICAgICAgICAgICAgICAgICAgICAgICsgXCJkeW5hbW9kYjpEZXNjcmliZVRhYmxlXCIsJTBBICAgICAgICAgICAgICAgICAgICAgICAgICArIFwiZHluYW1vZGI6RGVsZXRlSXRlbVwiLCUwQSAgICAgICAgICAgICAgICAgICAgICAgIF0lMEEgICAgICAgICAgICAgICAgICAgICAgKyBFZmZlY3QgICA9IFwiQWxsb3dcIiUwQSAgICAgICAgICAgICAgICAgICAgICArIFJlc291cmNlID0gXCJhcm46YXdzOmR5bmFtb2RiOnVzLXdlc3QtMToyODkyNTYxMzg2MjQ6dGFibGUvaW5mcmFob3VzZS10ZXJyYWZvcm0tc3RhdGUtbG9ja3NcIiUwQSAgICAgICAgICAgICAgICAgICAgICArIFNpZCAgICAgID0gXCJcIiUwQSAgICAgICAgICAgICAgICAgICAgfSwlMEEgICAgICAgICAgICAgICAgXSUwQSAgICAgICAgICAgICAgKyBWZXJzaW9uICAgPSBcIjIwMTItMTAtMTdcIiUwQSAgICAgICAgICAgIH0lMEEgICAgICAgICklMEEgICAgICArIHBvbGljeV9pZCAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgdGFnc19hbGwgICAgPSB7JTBBICAgICAgICAgICsgXCJjcmVhdGVkX2J5XCIgPSBcImluZnJhaG91c2UvYXdzLWNvbnRyb2wtMjg5MjU2MTM4NjI0XCIlMEEgICAgICAgIH0lMEEgICAgfSUwQSUwQSAgIyBtb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3LXN0YXRlLW1hbmFnZXIuYXdzX2lhbV9yb2xlLnN0YXRlLW1hbmFnZXIgd2lsbCBiZSBjcmVhdGVkJTBBICArIHJlc291cmNlIFwiYXdzX2lhbV9yb2xlXCIgXCJzdGF0ZS1tYW5hZ2VyXCIgeyUwQSAgICAgICsgYXJuICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgYXNzdW1lX3JvbGVfcG9saWN5ICAgID0ganNvbmVuY29kZSglMEEgICAgICAgICAgICB7JTBBICAgICAgICAgICAgICArIFN0YXRlbWVudCA9IFslMEEgICAgICAgICAgICAgICAgICArIHslMEEgICAgICAgICAgICAgICAgICAgICAgKyBBY3Rpb24gICAgPSBcInN0czpBc3N1bWVSb2xlXCIlMEEgICAgICAgICAgICAgICAgICAgICAgKyBFZmZlY3QgICAgPSBcIkFsbG93XCIlMEEgICAgICAgICAgICAgICAgICAgICAgKyBQcmluY2lwYWwgPSB7JTBBICAgICAgICAgICAgICAgICAgICAgICAgICArIEFXUyA9IFslMEEgICAgICAgICAgICAgICAgICAgICAgICAgICAgICArIFwiYXJuOmF3czppYW06Ojk5MDQ2Njc0ODA0NTp1c2VyL2FsZWtzXCIsJTBBICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgKyBcImFybjphd3M6aWFtOjozMDM0Njc2MDI4MDc6cm9sZS9paC10Zi1hd3MtY29udHJvbC0zMDM0Njc2MDI4MDctZ2l0aHViXCIsJTBBICAgICAgICAgICAgICAgICAgICAgICAgICAgIF0lMEEgICAgICAgICAgICAgICAgICAgICAgICB9JTBBICAgICAgICAgICAgICAgICAgICAgICsgU2lkICAgICAgID0gXCIwMDBcIiUwQSAgICAgICAgICAgICAgICAgICAgfSwlMEEgICAgICAgICAgICAgICAgXSUwQSAgICAgICAgICAgICAgKyBWZXJzaW9uICAgPSBcIjIwMTItMTAtMTdcIiUwQSAgICAgICAgICAgIH0lMEEgICAgICAgICklMEEgICAgICArIGNyZWF0ZV9kYXRlICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIGRlc2NyaXB0aW9uICAgICAgICAgICA9IFwiUm9sZSB0byBtYW5hZ2UgYSB0ZXJyYWZvcm0gc3RhdGUgb2YgYSByZXBvXCIlMEEgICAgICArIGZvcmNlX2RldGFjaF9wb2xpY2llcyA9IGZhbHNlJTBBICAgICAgKyBpZCAgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBtYW5hZ2VkX3BvbGljeV9hcm5zICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBtYXhfc2Vzc2lvbl9kdXJhdGlvbiAgPSAzNjAwJTBBICAgICAgKyBuYW1lICAgICAgICAgICAgICAgICAgPSBcImloLXRmLWF3cy1jb250cm9sLTMwMzQ2NzYwMjgwNy1zdGF0ZS1tYW5hZ2VyXCIlMEEgICAgICArIG5hbWVfcHJlZml4ICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIHBhdGggICAgICAgICAgICAgICAgICA9IFwiL1wiJTBBICAgICAgKyByb2xlX2xhc3RfdXNlZCAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyB0YWdzX2FsbCAgICAgICAgICAgICAgPSB7JTBBICAgICAgICAgICsgXCJjcmVhdGVkX2J5XCIgPSBcImluZnJhaG91c2UvYXdzLWNvbnRyb2wtMjg5MjU2MTM4NjI0XCIlMEEgICAgICAgIH0lMEEgICAgICArIHVuaXF1ZV9pZCAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgfSUwQSUwQSAgIyBtb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3LXN0YXRlLW1hbmFnZXIuYXdzX2lhbV9yb2xlX3BvbGljeV9hdHRhY2htZW50LnN0YXRlLW1hbmFnZXIgd2lsbCBiZSBjcmVhdGVkJTBBICArIHJlc291cmNlIFwiYXdzX2lhbV9yb2xlX3BvbGljeV9hdHRhY2htZW50XCIgXCJzdGF0ZS1tYW5hZ2VyXCIgeyUwQSAgICAgICsgaWQgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIHBvbGljeV9hcm4gPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyByb2xlICAgICAgID0gXCJpaC10Zi1hd3MtY29udHJvbC0zMDM0Njc2MDI4MDctc3RhdGUtbWFuYWdlclwiJTBBICAgIH0lMEElMEFQbGFuOiAzIHRvIGFkZCwgMCB0byBjaGFuZ2UsIDAgdG8gZGVzdHJveS4lMEElMEFcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDAlMEElMEFTYXZlZCB0aGUgcGxhbiB0bzogdGYucGxhbiUwQSUwQVRvIHBlcmZvcm0gZXhhY3RseSB0aGVzZSBhY3Rpb25zLCBydW4gdGhlIGZvbGxvd2luZyBjb21tYW5kIHRvIGFwcGx5OiUwQSAgICB0ZXJyYWZvcm0gYXBwbHkgXCJ0Zi5wbGFuXCIlMEFSZWxlYXNpbmcgc3RhdGUgbG9jay4gVGhpcyBtYXkgdGFrZSBhIGZldyBtb21lbnRzLi4uJTBBXG46OmRlYnVnOjpzdGRlcnI6IFxuOjpkZWJ1Zzo6ZXhpdGNvZGU6IDBcbiIsICJzdGRlcnIiOiAiIiwgImFkZCI6IDMsICJjaGFuZ2UiOiAwLCAiZGVzdHJveSI6IDB9fQ==```
</p></details>